/* <================================================================================================================> */
/* <============================================== НЕОБХОДИМЫЕ МОДУЛИ ==============================================> */
/* <================================================================================================================> */

// 1. Модуль Gulp - предоставляет функционал для работы с  Gulp:
import gulp from "gulp";

// 2. Модуль WebpackStream - предоставляет функционал для объединения JS-файлов:
import webpack from "webpack-stream";
import babel from "gulp-babel";


// 3. Пользовательский модуль Path - предоставляет информацию о путях к необходимым файлам/папкам:
import { path } from "../config/path.js";


/* <================================================================================================================> */
/* <============================= РЕАЛИЗАЦИЯ ЗАДАЧИ СОЗДАНИЯ РЕЗУЛЬТИРУЮЩЕГО JS ФАЙЛА ==============================> */
/* <================================================================================================================> */

// Функция объединяет js-файлы и перемещает из папки с исходниками в папку с результатом:
export const jsProcessing = () => {
    return gulp.src(path.src.js, { sourcemap: true })
        .pipe(webpack({
            mode: "development",
            output: { filename: "app.min.js" },
            module: {
                rules: [
                    {
                        test: /\.(js)$/,
                        exclude: /(node_modules|bower_components)/,
                        use: {
                            loader: 'babel-loader',
                            options: {
                                presets: ['@babel/preset-env'],
                                cacheDirectory: true,
                            }
                        }
                    },
                ]
            },
        }))
        .pipe(gulp.dest(path.build.js));
};